In [6]:
d = [{'prajakta_test_assignment':1234}]
for i in d:
    #print(i)
    for k,v in i.items():
        print(k.split('_')[-2])

test

In [23]:
max_count = max(d.values(), key=list(d.values()).count)
filtered_dict = {k: v for k, v in d.items() if v == max_count}

print(filtered_dict)

{'a': 1, 'd': 1, 'e': 1}

In [28]:
d = {'a':1,'b':2,'c':2,'d':1,'e':1}
m = max(d.values(),key=list(d.values()).count)
print(m)
{k:v for k,v in d.items() if v==m}

1

{'a': 1, 'd': 1, 'e': 1}

In [31]:
m=max(d.values(),key=list(d.values()).count)
{k:v for k,v in d.items() if v==m}

{'a': 1, 'd': 1, 'e': 1}

In [8]:
l = [1,2,2,2,3,3,5,6,6,7]
# target 2

n=l.index(2)
n

1

In [13]:
l1=l[::-1]
n2=l1.index(2)
len(l)-n2-1

3

In [48]:
l[n+l.index(2)+l.index(2)]

3

In [57]:
l = [1,2,2,2,3,3,5,6,6,7]
d1={}
for i in l:
    d1[i]=l.count(i)
print(d1)
mx = max(d1.values())
for k,v in d1.items():
    if v==mx:
        print(k)

{1: 1, 2: 3, 3: 2, 5: 1, 6: 2, 7: 1}
2

In [58]:
max(d1.keys())

7

In [51]:
rev=l[::-1]
print(rev)

[7, 6, 6, 5, 3, 3, 2, 2, 2, 1]

In [50]:
rev.index(2)

6

In [54]:
len(l)-1-rev.index(2)

3

In [52]:
l = [1, 2, 2, 2, 3, 3, 5, 6, 6, 7]

last_index_of_2 = len(l) - 1 - l[::-1].index(2)

print(last_index_of_2)

3

In [14]:
from collections import Counter
l = [1, 2, 2, 2, 3, 3, 5, 6, 6, 7]
c = Counter(l)
print(c)
max_val,cnt=c.most_common(1)[0]
print(max_val)
print(cnt)

Counter({2: 3, 3: 2, 6: 2, 1: 1, 5: 1, 7: 1})
2
3

In [16]:
c.most_common(1)

[(2, 3)]

In [76]:
list(c.elements())

[1, 2, 2, 2, 3, 3, 5, 6, 6, 7]

In [66]:
from collections import Counter

l = [1, 2, 2, 2, 3, 3, 5, 6, 6, 7]
counter = Counter(l)

max_element, max_count = counter.most_common(1)[0]

print("Max value:", max_element)
print("Count:", max_count)

Max value: 2
Count: 3

In [77]:
def reverse_and_swap_case(sentence):
    # Reverse the sentence
    reversed_sentence = sentence[::-1]

    # Swap the cases of each character while preserving the case
    swapped_case_sentence = ''.join([char.swapcase() for char in reversed_sentence])

    return swapped_case_sentence

# Example usage:
sentence = 'rUns dOgs'
result = reverse_and_swap_case(sentence)
print(result)

SGoD SNuR

In [78]:
def reverse_and_swap_case(sentence):
    # Split the sentence into words
    words = sentence.split()

    # Reverse the words and swap the case of each character in the reversed words
    reversed_sentence = ' '.join([word[::-1].swapcase() for word in words])

    return reversed_sentence

# Example usage:
sentence = 'rUns dOgs'
result = reverse_and_swap_case(sentence)
print(result)

SNuR SGoD

In [79]:
def reverse_and_swap_case(sentence):
    # Reverse the sentence while preserving the case of each character
    reversed_sentence = ''.join([char.lower() if char.isupper() else char.upper() for char in sentence[::-1]])

    # Capitalize the first character of each word
    result = ' '.join([word.capitalize() for word in reversed_sentence.split()])

    return result

# Example usage:
sentence = 'aWSOME is cODING'
result = reverse_and_swap_case(sentence)
print(result)

Gnidoc Si Emoswa

In [83]:
sentence = 'aWSOME is cODING'
l = list(sentence.split())
for i in l:
    for j in i:
        if j.isupper():
            j=j.lower()
        else:
            j=j.upper()

In [89]:
sentence = 'aWSOME is cODING'
words = sentence.split()
result = []

for word in words:
    modified_word = ''
    for letter in word:
        if letter.isupper():
            modified_word += letter.lower()
        elif letter.islower():
            modified_word += letter.upper()
    result.append(modified_word)

print(' '.join(result))

Awsome IS Coding

In [90]:
sentence = 'aWSOME is cODING'
words = sentence.split()
result = []
words

['aWSOME', 'is', 'cODING']

In [92]:
def swap_case_within_words(sentence):
    words = sentence.split()
    result = []

    for word in words:
        modified_word = ''
        for letter in word:
            if letter.isupper():
                modified_word += letter.lower()
            elif letter.islower():
                modified_word += letter.upper()
        result.append(modified_word)

    return ' '.join(result[::-1])

# Example usage:
sentence = 'aWSOME is cODING'
result = swap_case_within_words(sentence)
print(result)

Coding IS Awsome

In [94]:
class Car:
    def __init__(self, max_speed, unit):
        self.max_speed = max_speed
        self.unit = unit

    def __str__(self):
        return 'Car with the maximum speed of ' + str(self.max_speed) + ' ' + str(self.unit)


class Boat:
    def __init__(self, max_speed):
        self.max_speed = max_speed

    def __str__(self):
        return 'Boat with the maximum speed of ' + str(self.max_speed) + ' knots'


car = Car(120, 'km/h')
print(car)

Car with the maximum speed of 120 km/h

In [3]:
class calculator:
    def add(self,n1,n2):
        return n1+n2
    
    def sub(self,n1,n2):
        return n1-n2

In [6]:
cal=calculator()
print(cal.add(5,3))
print(cal.sub(5,3))

8
2

Why Use self?
Consistency: self is a convention that makes code more readable and understandable.
Flexibility: It allows methods to access and modify the instance's state, making the class more flexible and powerful.

In [95]:
def car_description(max_speed, unit):
    return 'Car with the maximum speed of ' + str(max_speed) + ' ' + str(unit)

def boat_description(max_speed):
    return 'Boat with the maximum speed of ' + str(max_speed) + ' knots'

car = car_description(120, 'km/h')
print(car)

Car with the maximum speed of 120 km/h

In [ ]:
select c.customer_name, CAST(sum(i.total_price) AS DECIMAL(9,6)) as total from customer c
inner join invoice i on c.id = i.customer_id
group by customer_name
having sum(i.total_price)<=0.25*
(select avg(total_price) from invoice)
order by total desc;

In [103]:
def swap_case(s):
    case=''
    for i in s:
        if i.isupper():
            case+=i.lower()
        elif i.islower():
            case+=i.upper()
        elif not i.isalnum():
            case+=i
        elif i.isdigit():
            case+=i
    return case

In [104]:
swap_case('sEntEnce is.Com_ 2')

'SeNTeNCE IS.cOM_ 2'

In [111]:
s = 'this is a string '
l=s.split(' ')
l='-'.join(l)
l

'this-is-a-string-'

In [112]:
def split_and_join(line):
    l=line.split(' ')
    l='-'.join(l)
    return l

if __name__ == '__main__':
    line = input()
    result = split_and_join(line)
    print(result)

this is a string
this-is-a-string

In [115]:
def print_full_name(first, last):
    return f'Hello {first} {last} ! You just delved into python'

In [119]:
def print_full_name(first, last):
            text = "Hello {} {}! You just delved into python."
            print(text.format(first , last))


if __name__ == '__main__':
    first_name = input()
    last_name = input()
    print_full_name(first_name, last_name)

prajakta
adhav
Hello prajakta adhav! You just delved into python.

In [128]:
s = 'abracadabra'
l=list(s)
l[5]= 'k'
s=''.join(l)
s

'abrackdabra'

In [129]:
s = 'abracadabra'
s = s[:5]+'k'+s[6:]
s

'abrackdabra'

In [132]:
a='ABCDCDC'
a.count('CDC')

1

In [141]:
def count_substring(string, sub_string):
    count = 0
    l = len(sub_string)
    
    for i in range(0, len(string)):
        if string[i:l + i] == sub_string:
            count += 1
        print(string[i:l + i] )
        
    return count

In [142]:
count_substring('ABCDCDC','CDC')

ABC
BCD
CDC
DCD
CDC
DC
C

2

In [56]:
s = 'a2J'

a = any(char.isalnum() for char in s)
b = any(char.isalpha() for char in s)
c = any(char.isdigit() for char in s)
d = any(char.islower() for char in s)
e = any(char.isupper() for char in s)

print(a)
print(b)
print(c)
print(d)
print(e)

True
True
True
True
True

In [160]:
width = 20
print ('HackerRank'.rjust(width,'-'))
print ('HackerRank'.ljust(width,'-'))
print ('HackerRank'.center(width,'-'))

----------HackerRank
HackerRank----------
-----HackerRank-----

In [54]:
'HackerRank'.rjust(20,'-')

'----------HackerRank'

In [163]:
n = int(input())
integer_list = map(int, input().split())
print(hash(tuple(integer_list)))

2
12
-860454829093830431

In [53]:
import textwrap

# Define the string
s = 'ABCDEFGHIJKLIMNOQRSTUVWXYZ'

# Define the wrap function
def wrap(string, max_width):
    words = textwrap.fill(text=string, width=max_width)
    return words

# Call the wrap function
result = wrap(s, 4)
print(result)

ABCD
EFGH
IJKL
IMNO
QRST
UVWX
YZ

In [63]:
from collections import Counter
s='prajakta'
print(Counter(s))

Counter({'a': 3, 'p': 1, 'r': 1, 'j': 1, 'k': 1, 't': 1})

In [69]:
l = [1,2,3,4,5]
l1=l
l1.reverse()
print(l1)

[5, 4, 3, 2, 1]

In [92]:
for i in range (1,18):
    print(i,' ',oct(i)[2:],' ',hex(i)[2:].upper(),bin(i)[2:], )

1   1   1 1
2   2   2 10
3   3   3 11
4   4   4 100
5   5   5 101
6   6   6 110
7   7   7 111
8   10   8 1000
9   11   9 1001
10   12   A 1010
11   13   B 1011
12   14   C 1100
13   15   D 1101
14   16   E 1110
15   17   F 1111
16   20   10 10000
17   21   11 10001

In [105]:
s='prajakta adhav'
l=[]
for i in s.split():
    l.append(i.capitalize())
    a=' '.join(l)
a

'Prajakta Adhav'

In [106]:
def minion_game(string):
    string_len = len(string)
    stuart_score = 0
    kevin_score = 0

    for letter in range(string_len):
        if string[letter] in 'AEIOU':
            kevin_score += (string_len - letter)
        else:
            stuart_score += (string_len - letter)

    if stuart_score > kevin_score:
        print("Stuart", stuart_score)
    elif kevin_score > stuart_score:
        print("Kevin", kevin_score)
    else:
        print("Draw")

In [107]:
minion_game('banana')

Stuart 21

In [5]:
d1 = {'mango':1,'apple':2,'orange':2,'banana':1,'guava':1}
sorted(d1.items(),key=lambda x:x[1], reverse=True)[:2]

[('apple', 2), ('orange', 2)]

In [20]:
ls=[]
for k,v in d1.items():
    ls.append(v)
    ls.sort(reverse=True)
print(ls)
print(max(ls))
n=max(ls)

for k,v in d1.items():
    if v==n:
        print(k,v)

[2, 2, 1, 1, 1]
2
apple 2
orange 2

In [23]:
d2 = ('data':('id':1, 'name':'xyz','age':25),('id':2,'name':'ssd','age':26))
d2

SyntaxError: invalid syntax (1978305889.py, line 1)

In [26]:
l1 =[1,2,3,5,6]
missing =[]
for i in range(min(l1),max(l1)+1):
    if i not in l1:
        missing.append(i)
print(missing)

[4]

In [2]:
l=[]
for i in range (50,101):
    for j in range (2,i):
        if i%j==0:
            break
    else:
        l.append(i)
print(l[::-1])

[97, 89, 83, 79, 73, 71, 67, 61, 59, 53]

In [ ]:
def class calculator(n1,n2):

In [17]:
s='Hello World Python is Fun'
l=s.split()
n=''
for j in range (len(l)):
    if j%2==0:
        n=''.join(l[j])
        print(n,end=' ')

Hello Python Fun

In [22]:
n = 123

def is_palindrome(n):
    rev =0
    while n!=0:
        rem=n%10
        rev= rev*10+rem
        n= n//10
    if n==rev:
        return True
    else:
        return False

In [23]:
is_palindrome(123)

False

In [24]:
s='book'
d={}
for i in s:
    d[i]=s.count(i)
print(d)

{'b': 1, 'o': 2, 'k': 1}

In [31]:

# A pangram is a sentence that contains every letter of the alphabet at least once.

def is_pangram(s):
    a= set(s)
    l=[]
    for i in a:
        if i.isalpha():
            l.append(i)
    if len(l)==27:
        return True
    else:
        return False      

s='The quick brown fox jumps over the lazy dog'
is_pangram(s)

True

In [32]:
is_pangram('hello world')

False

In [55]:
def perfect_sq(n):
    import math
    no = math.sqrt(n)
    if no.is_integer():
        return True
    else:
        return False

In [56]:
perfect_sq(16)

True

In [57]:
perfect_sq(2)

False

In [61]:
string1 = 'hello'
string2 = 'world'
s=set()
for i in string1:
    if i in string2:
        s.add(i)
for j in s:
    print(j)

o
l

In [73]:
s = 'racecar@@'


def is_palindrome(s):
    n=''
    for i in s:
        if not i.isalnum():
            pass
        elif i.isdigit():
            pass
        else:
            n+=i
    if n==n[::-1]:
        return True
    else:
        return False

In [74]:
is_palindrome('ma3laya5lam')

True

#### You are given a list of numbers as input. Write a program to find the sum of all the numbers in the list using recursion.

In [89]:
def lst_sm(l):
    if len(l) == 0:
        return 0
    else:
        return l[0] + lst_sm(l[1:])

l = [1, 2, 3, 4, 5]    
print(lst_sm(l))

15

In [90]:
numbers = input().split()

1 2 3 4 5

In [91]:
type(numbers)

list

In [93]:
numbers[1:]

['2', '3', '4', '5']

In [101]:
List1 = [6, 3, 1, 8, 9, 2, 10, 12, 7, 4, 11]
start = 3
end = 8
l = []
l.extend(List1[:3])
l.extend(List1[3:9][::-1])
l.extend(List1[9:])
print(l)

[6, 3, 1, 7, 12, 10, 2, 9, 8, 4, 11]

In [123]:
m = [[4, 3, 1], ['python', 3, {4:2}], [3, 1, 'java'], [9, (2, 3)]]
s = set()

for i in m:
    for j in range(len(i)):
        # Append the type of each item to the set
        s.add(type(i[j]))

# Print the set of unique data types
print(s)

{<class 'str'>, <class 'dict'>, <class 'tuple'>, <class 'int'>}

You are given a number n as input. Write a program to print a half-diamond pattern of numbers with a star border.

Sample Input:
5
Sample Output:
*
*1*
*121*
*12321*
*1234321*

In [138]:
n=5
for i in range(1, n):
    row = "*"  # Start each row with a star
        # Append numbers from 1 to i
    for j in range(1, i + 1):
        row += str(j)
        # Append numbers from i - 1 down to 1
    for j in range(i - 1, 0, -1):
        row += str(j)
    row += "*"  # End each row with a star
    print(row)

*1*
*121*
*12321*
*1234321*

You are given a string as input. Write a program to find the start and end indices of each word in the string.

In [71]:
s = 'Prajakta adhav adhav'
words=s.split()
ci = 0
result=[]

for i in words:
    si = s.find(i,ci)
    ei=si+len(i)-1
    result.append((si,ei))
    ci= ei+1
result

[(0, 7), (9, 13), (15, 19)]

In [73]:
s.find('adhav',14)

15

In [66]:
def find_word_indices(input_string):
    words = input_string.split()
    current_index = 0
    result = []

    for word in words:
        start_index = input_string.find(word, current_index)
        end_index = start_index + len(word) - 1
        result.append((start_index, end_index))
        current_index = end_index + 1
    
    return result

In [67]:
input_string = "This is a sample string"
indices = find_word_indices(input_string)
for start, end in indices:
    print(f"Word starts at {start} and ends at {end}")

Word starts at 0 and ends at 3
Word starts at 5 and ends at 6
Word starts at 8 and ends at 8
Word starts at 10 and ends at 15
Word starts at 17 and ends at 22

In [90]:
r = [['chi',20],['beta',50],['alpha',50]]
r.sort()
l=[]
for i in r:
    l.append(i[1])
maximum=max(l)
for i in r:
    if i[1]==maximum:
        print(i[0])

alpha
beta

In [81]:
sorted(r)

[['alpha', 50], ['beta', 50], ['chi', 20]]

In [11]:
import pandas as pd

df = pd.DataFrame(columns=['Name', 'Age'])

# Write your code below

def add_to_df(df):
    name = input('enter your name:')
    age =int(input('enter your age:'))
    new_row =pd.DataFrame({'Name':[name], 'Age':[age]})
    df= pd.concat([df,new_row],ignore_index=True)
    return df

df=add_to_df(df)
df=add_to_df(df)
df

enter your name:p
enter your age:9
enter your name:i
enter your age:3

  Name Age
0    p   9
1    i   3

In [8]:
def add_to_df(df):
    name = input('enter your name:')
    age = int(input('enter your age:'))
    df.loc[len(df)] = [name, age]
    return df

add_to_df(df)
add_to_df(df)

enter your name:p
enter your age:78
enter your name:h
enter your age:65

  Name  Age
0    p   78
1    h   65

In [9]:
len(df)

2

You are given a DataFrame with integer values. Write a program to find the maximum value in the DataFrame. The DataFrame will be provided by the user as input.

In [25]:
input_data = input()
data = [list(map(int, row.split())) for row in input_data.split(',')]
df = pd.DataFrame(data)

0,3,5,7,3,9,5,6,4

In [29]:
df.max()[0]

9

In [27]:
input_data = input()
input_data.split(',')

1,2,3,4,5

['1', '2', '3', '4', '5']

In [28]:
data = [list(map(int, row.split())) for row in input_data.split(',')]
data

[[1], [2], [3], [4], [5]]

In [31]:
d=pd.DataFrame({'c1':[1,2,3,9,8,7],'c2':[2,3,8,7,5,4]})
d

   c1  c2
0   1   2
1   2   3
2   3   8
3   9   7
4   8   5
5   7   4

In [33]:
d.max().max()                # Double max function to find max among all rows and columns.

9

In [35]:
import pandas as pd

df = pd.DataFrame({'Name': ['Alice', 'Bob'], 'Age': [20, 30]})

name = input()
age = int(input())
row = {'Name':name,'Age':age}
df.append(row,ignore_index=True)

h
9

C:\Users\91973\AppData\Local\Temp\ipykernel_2708\2490799322.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(row,ignore_index=True)

    Name  Age
0  Alice   20
1    Bob   30
2      h    9

In [39]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'C': [7, 8, 9], 'D': [10, 11, 12]})
df = pd.concat([df1,df2],axis=1)

In [40]:
df

   A  B  C   D
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [44]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'value2': [4, 5, 6]})

In [45]:
df1.merge(df2, how='inner', on='key')

  key  value1  value2
0   B       2       4
1   C       3       5

In [46]:
import pandas as pd

def calculate_stats(df, column_name):
    mi = df[column_name].min()
    ma = df[column_name].max()
    av = df[column_name].mean()
    return f'Minimum: {mi}\nMaximum: {ma}\nAverage: {av}'

df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [6, 7, 8, 9, 10]})
column_name = input()
print(calculate_stats(df, column_name))

A
Minimum: 1
Maximum: 5
Average: 3.0

In [51]:
df = pd.DataFrame({'Name': ['John', 'Mary', 'Alex'], 'Score': [90, 85, 95]})
df.set_index('Name',inplace=True)
print(df)

      Score
Name
John     90
Mary     85
Alex     95

praju:23

In [57]:
l=input_str.split(':')

In [63]:
input_str = input()
l = input_str.split(':')
d = {}

for i in range(0, len(l), 2):
    k = l[i].strip()
    if i+1 < len(l):
        v = l[i+1].strip()
    else:
        v = None
    d[k] = v

d

p: 37 , dk:39

{'p': '37 , dk', '39': None}

In [64]:
input_str = input()
l = input_str.split(':')
d = {}

for i in range(0, len(l) - 1, 2):
    k = l[i].strip()
    v = l[i + 1].strip()
    d[k] = v

# Handle case where there is an odd number of elements
if len(l) % 2 != 0:
    d[l[-1].strip()] = None

print(d)

p: 37 , dk:39
{'p': '37 , dk', '39': None}

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

df= pd.read_excel('ScoreCard.xlsx')
df.head()

,ID,LastName,First Name,City,State,Gender,Student Status,Major,Country,Age,Actual Marks,scaled score (grade),Height (in),Newspaper readership (times/wk)
0,1,DOE01,JANE01,Los Angeles,California,Female,Graduate,Politics,US,30,2263,67.000000,61,5
1,2,DOE02,JANE02,Sedona,Arizona,Female,Undergraduate,Math,US,19,2006,63.000000,64,7
2,3,DOE01,JOE01,Elmira,New York,Male,Graduate,Math,US,26,2221,78.113285,73,6
3,4,DOE02,JOE02,Lackawana,New York,Male,Graduate,Econ,US,33,1716,77.808587,68,3
4,5,DOE03,JOE03,Defiance,Ohio,Male,Graduate,Econ,US,37,1701,65.000000,71,6

In [3]:
df['Age'].mean()

25.2

In [5]:
df.columns

Index(['ID', 'LastName', 'First Name', 'City', 'State', 'Gender',
       'Student Status', 'Major', 'Country', 'Age', 'Actual Marks ',
       ' scaled score (grade)', 'Height (in)',
       'Newspaper readership (times/wk)'],
      dtype='object')

In [9]:
df.mean()

C:\Users\91973\AppData\Local\Temp\ipykernel_12348\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

ID                                   15.500000
Age                                  25.200000
Actual Marks                       1848.900000
 scaled score (grade)                80.400915
Height (in)                          66.433333
Newspaper readership (times/wk)       4.866667
dtype: float64

In [12]:
df[df['Student Status']=='Graduate'][' scaled score (grade)'].mean()

80.84112266561891

In [13]:
df[df['Student Status']=='Undergraduate'][' scaled score (grade)'].mean()

79.96070697313499

In [16]:
df[df['Gender']=='Female']['Height (in)'].median()

63.0

In [18]:
q1=df['Age'].quantile(0.25)
q3=df['Age'].quantile(0.75)
q3-q1

11.0

In [20]:
max(df['Age'])-min(df['Age'])

21

In [22]:
df['Age'].max()-df['Age'].min()

21

In [30]:
d=df[df['Country']=='US']
d.groupby('Gender')['Newspaper readership (times/wk)'].mean()

Gender
Female    5.4
Male      4.6
Name: Newspaper readership (times/wk), dtype: float64

In [33]:
df.groupby(['Major'])['Age'].mean()

Major
Econ        23.8
Math        23.0
Politics    28.8
Name: Age, dtype: float64

How much is the difference between the average marks ( Actual Marks column) for the students who read the newspaper for 7 times/week vs the ones who read the newspaper for 3 times/week?

In [36]:
df.columns

Index(['ID', 'LastName', 'First Name', 'City', 'State', 'Gender',
       'Student Status', 'Major', 'Country', 'Age', 'Actual Marks ',
       ' scaled score (grade)', 'Height (in)',
       'Newspaper readership (times/wk)'],
      dtype='object')

In [37]:
df.groupby('Newspaper readership (times/wk)')['Actual Marks '].mean()

Newspaper readership (times/wk)
3    1834.000000
4    1822.000000
5    1859.000000
6    1852.285714
7    1885.333333
Name: Actual Marks , dtype: float64

In [38]:
 1885.333333-1834.000000

51.33333300000004

What is the average height of the students who got more than 2000 as actual marks?

In [42]:
df[df['Actual Marks ']>2000]['Height (in)'].mean()

66.88888888888889

Are there more number of undergraduates than graduates in economics as a major

In [48]:
dd=df[df['Major']=='Econ']
dd.groupby('Student Status').count()

,ID,LastName,First Name,City,State,Gender,Major,Country,Age,Actual Marks,scaled score (grade),Height (in),Newspaper readership (times/wk)
Student Status,,,,,,,,,,,,,
Graduate,4,4,4,4,4,4,4,4,4,4,4,4,4
Undergraduate,6,6,6,6,6,6,6,6,6,6,6,6,6

In [52]:
# The student who got the highest Actual Marks is from which country?
df[df['Actual Marks ']==2309]

,ID,LastName,First Name,City,State,Gender,Student Status,Major,Country,Age,Actual Marks,scaled score (grade),Height (in),Newspaper readership (times/wk)
27,28,DOE15,JANE15,Loco,Oklahoma,Female,Undergraduate,Econ,US,20,2309,64.0,68,6

In [55]:
df.sort_values(by='Actual Marks ',ascending=False)

,ID,LastName,First Name,City,State,Gender,Student Status,Major,Country,Age,Actual Marks,scaled score (grade),Height (in),Newspaper readership (times/wk)
27,28,DOE15,JANE15,Loco,Oklahoma,Female,Undergraduate,Econ,US,20,2309,64.000000,68,6
28,29,DOE14,JOE14,Buenos Aires,Argentina,Male,Graduate,Politics,Argentina,30,2279,85.000000,72,3
0,1,DOE01,JANE01,Los Angeles,California,Female,Graduate,Politics,US,30,2263,67.000000,61,5
18,19,DOE11,JANE11,Caracas,Venezuela,Female,Undergraduate,Math,Venezuela,18,2252,92.000000,68,5
17,18,DOE10,JANE10,Mexico,Mexico,Female,Graduate,Politics,Mexico,31,2248,95.423560,59,4
2,3,DOE01,JOE01,Elmira,New York,Male,Graduate,Math,US,26,2221,78.113285,73,6
26,27,DOE13,JOE13,Intercourse,Pennsylvania,Male,Undergraduate,Math,US,20,2119,88.000000,71,5
9,10,DOE05,JANE05,New York,New York,Female,Graduate,Math,US,33,2041,71.000000,66,5
1,2,DOE02,JANE02,Sedona,Arizona,Female,Undergraduate,Math,US,19,2006,63.000000,64,7
19,20,DOE09,JOE09,San Juan,Puerto Rico,Male,Graduate,Politics,US,33,1923,95.000000,63,7
24,25,DOE11,JOE11,Stockholm,Sweden,Male,Undergraduate,Politics,Sweden,19,1919,88.000000,64,4
29,30,DOE15,JOE15,Acme,Louisiana,Male,Undergraduate,Econ,US,19,1907,79.499360,74,3
21,22,DOE10,JOE10,New York,New York,Male,Undergraduate,Econ,US,21,1872,82.000000,73,4
7,8,DOE03,JANE03,Liberal,Kansas,Female,Undergraduate,Politics,US,21,1842,87.000000,62,5
15,16,DOE08,JANE08,Mexican Hat,Utah,Female,Undergraduate,Econ,US,18,1821,80.000000,63,3
8,9,DOE04,JANE04,Montreal,Canada,Female,Undergraduate,Math,Canada,18,1813,91.000000,62,6
10,11,DOE06,JOE06,Hot Coffe,Mississippi,Male,Undergraduate,Econ,US,18,1787,81.525285,67,3
5,6,DOE04,JOE04,Tel Aviv,Israel,Male,Graduate,Econ,Israel,25,1786,69.000000,67,5
22,23,DOE13,JANE13,The X,Massachusetts,Female,Graduate,Politics,US,25,1767,89.000000,68,6
20,21,DOE12,JANE12,Remote,Oregon,Female,Undergraduate,Econ,US,19,1727,67.000000,62,7
3,4,DOE02,JOE02,Lackawana,New York,Male,Graduate,Econ,US,33,1716,77.808587,68,3
4,5,DOE03,JOE03,Defiance,Ohio,Male,Graduate,Econ,US,37,1701,65.000000,71,6
23,24,DOE14,JANE14,Beijing,China,Female,Undergraduate,Math,China,18,1643,79.000000,65,6
12,13,DOE07,JOE07,Varna,Bulgaria,Male,Graduate,Politics,Bulgaria,30,1637,79.337239,63,4
6,7,DOE05,JOE05,Cimax,North Carolina,Male,Graduate,Politics,US,39,1577,95.882515,70,5
11,12,DOE06,JANE06,Java,Virginia,Female,Graduate,Math,US,38,1513,78.936614,59,5
13,14,DOE08,JOE08,Moscow,Russia,Male,Graduate,Politics,Russia,30,1512,70.279498,75,6
16,17,DOE09,JANE09,Amsterdam,Holland,Female,Undergraduate,Math,Holland,19,1494,75.000000,60,3
25,26,DOE12,JOE12,Embarrass,Minnesota,Male,Graduate,Econ,US,28,1434,95.835542,71,4
14,15,DOE07,JANE07,Drunkard Creek,New York,Female,Undergraduate,Math,US,21,1338,82.385960,64,5

In [ ]:
# 6. Is the average age of students studying politics is more than students studying mathematics?   True
# 5.Is the Average NewsPaper Readership is more for females as compared to males in US?  True
# 4. What is the Range of Age for all the applicants?  21
# 3. What is the median Height for female applicants?  63
# 2. What is the average score (grade)? It is the same for graduates and undergraduates? 80,no
# 1. What is the mean age of the applicants? 25.2